Беларусь_мобильный_клиент/src/Documents/уи_ИнвентаризацияИмущества/уи_ИнвентаризацияИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уи_ИнвентаризацияИмущества</name>
  <comment>Инвентаризация имущества</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаИнвентаризации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияИнвентаризации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <comment>Материально-ответственное лицо</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Имущество</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Имущество</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.уи_Имущество</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеПоДаннымУчета</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеФактическое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Беларусь_мобильный_клиент/src/Documents/уи_ИнвентаризацияИмущества/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ВвестиГолосом(Команда)
	#Если МобильноеПриложениеКлиент Тогда
	НовВз = Новый ЗапускПриложенияМобильногоУстройства("android.speech.action.RECOGNIZE_SPEECH");
	
	Если НовВз.Запустить(Истина) = 0 Тогда
		//Сообщить("Не поддерживается на вашем устройстве!");
	Иначе
		Объект.Комментарий = НовВз.ДополнительныеДанные.Получить("query").Значение;
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Объект.Комментарий = "";
КонецПроцедуры

&НаКлиенте
Процедура ИмуществоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ОпЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииСозданияСтроки",ЭтаФорма,Истина);
	ОткрытьФорму("Документ.уи_ИнвентаризацияИмущества.Форма.ФормаСтроки",,,,,,ОпЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииСозданияСтроки(Результат, Параметр) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда Возврат КонецЕсли;
	
	Нов = Объект.Имущество.Добавить();
	ЗаполнитьЗначенияСвойств(Нов, Результат);
КонецПроцедуры

&НаКлиенте
Процедура ИмуществоПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	Структура = Новый Структура("UID, Имущество, НаличиеФактическое");
	ЗаполнитьЗначенияСвойств(Структура, Элементы.Имущество.ТекущиеДанные);

	ОпЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииРедактированияСтроки",ЭтаФорма,Истина);
	ОткрытьФорму("Документ.уи_ИнвентаризацияИмущества.Форма.ФормаСтроки",Новый Структура("Входящие", Структура),,,,,ОпЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииРедактированияСтроки(Результат, Параметр) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда Возврат КонецЕсли;
	
	Нов = Элементы.Имущество.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(Нов, Результат);
КонецПроцедуры
